; ModuleID = 'unoptimized.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "armv4t-unknown-unknown"

%struct.cjpeg_wrbmp_jpeg_decompress_struct = type { %struct.cjpeg_wrbmp_jpeg_error_mgr*, %struct.cjpeg_wrbmp_jpeg_memory_mgr*, %struct.cjpeg_wrbmp_jpeg_progress_mgr*, i8*, i32, i32, %struct.cjpeg_wrbmp_jpeg_source_mgr*, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8**, i32, i32, i32, i32, i32, [64 x i32]*, [4 x %struct.CJPEG_WRBMP_JQUANT_TBL*], [4 x %struct.CJPEG_WRBMP_JHUFF_TBL*], [4 x %struct.CJPEG_WRBMP_JHUFF_TBL*], i32, %struct.cjpeg_wrbmp_jpeg_component_info*, i32, i32, [16 x i8], [16 x i8], [16 x i8], i32, i32, i8, i8, i8, i16, i16, i32, i8, i32, %struct.cjpeg_wrbmp_jpeg_marker_struct*, i32, i32, i32, i32, i8*, i32, [4 x %struct.cjpeg_wrbmp_jpeg_component_info*], i32, i32, i32, [10 x i32], i32, i32, i32, i32, i32, %struct.jpeg_decomp_master*, %struct.jpeg_d_main_controller*, %struct.jpeg_d_coef_controller*, %struct.jpeg_d_post_controller*, %struct.jpeg_input_controller*, %struct.jpeg_marker_reader*, %struct.jpeg_entropy_decoder*, %struct.jpeg_inverse_dct*, %struct.jpeg_upsampler*, %struct.jpeg_color_deconverter*, %struct.jpeg_color_quantizer* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "cjpeg_wrbmp_jpeg_dec_1", scope: !2, file: !153, line: 54, type: !164, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.6 (git@github.com:RTS-SYSU/LLVM-TA.git 433861ba697f56477d8849df0fa6165a1e09982d)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !25, globals: !150, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/workspaces/llvmta/testcases/batchtest/cjpeg_wrbmp/cjpeg_wrbmp.c", directory: "/workspaces/llvmta/testcases/batchtest/bsort")
!4 = !{!5, !15, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 201, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "cjpeg_wrbmp/jpeglib.h", directory: "/workspaces/llvmta/testcases/batchtest")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "JCS_UNKNOWN", value: 0)
!10 = !DIEnumerator(name: "JCS_GRAYSCALE", value: 1)
!11 = !DIEnumerator(name: "JCS_RGB", value: 2)
!12 = !DIEnumerator(name: "JCS_YCbCr", value: 3)
!13 = !DIEnumerator(name: "JCS_CMYK", value: 4)
!14 = !DIEnumerator(name: "JCS_YCCK", value: 5)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 212, baseType: !7, size: 32, elements: !16)
!16 = !{!17, !18, !19}
!17 = !DIEnumerator(name: "JDCT_ISLOW", value: 0)
!18 = !DIEnumerator(name: "JDCT_IFAST", value: 1)
!19 = !DIEnumerator(name: "JDCT_FLOAT", value: 2)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 220, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24}
!22 = !DIEnumerator(name: "JDITHER_NONE", value: 0)
!23 = !DIEnumerator(name: "JDITHER_ORDERED", value: 1)
!24 = !DIEnumerator(name: "JDITHER_FS", value: 2)
!25 = !{!26, !63, !51}
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "cjpeg_wrbmp_cd_progress_ptr", file: !27, line: 102, baseType: !28)
!27 = !DIFile(filename: "cjpeg_wrbmp/cdjpeg.h", directory: "/workspaces/llvmta/testcases/batchtest")
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 32)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cjpeg_wrbmp_cdjpeg_progress_mgr", file: !27, line: 92, size: 256, elements: !30)
!30 = !{!31, !147, !148, !149}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !29, file: !27, line: 94, baseType: !32, size: 160)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cjpeg_wrbmp_jpeg_progress_mgr", file: !6, line: 726, size: 160, elements: !33)
!33 = !{!34, !143, !144, !145, !146}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !32, file: !6, line: 727, baseType: !35, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 32)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "cjpeg_wrbmp_j_common_ptr", file: !6, line: 250, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cjpeg_wrbmp_jpeg_common_struct", file: !6, line: 241, size: 192, elements: !41)
!41 = !{!42, !73, !138, !140, !141, !142}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !40, file: !6, line: 242, baseType: !43, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cjpeg_wrbmp_jpeg_error_mgr", file: !6, line: 662, size: 416, elements: !45)
!45 = !{!46, !47, !52, !53, !59, !60, !61, !62, !64, !69, !70, !71, !72}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "error_exit", scope: !44, file: !6, line: 664, baseType: !35, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "emit_message", scope: !44, file: !6, line: 667, baseType: !48, size: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !38, !51}
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "output_message", scope: !44, file: !6, line: 670, baseType: !35, size: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "format_message", scope: !44, file: !6, line: 673, baseType: !54, size: 32, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !38, !57}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!58 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "reset_error_mgr", scope: !44, file: !6, line: 677, baseType: !35, size: 32, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "msg_code", scope: !44, file: !6, line: 683, baseType: !51, size: 32, offset: 160)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !44, file: !6, line: 693, baseType: !51, size: 32, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "num_warnings", scope: !44, file: !6, line: 701, baseType: !63, size: 32, offset: 224)
!63 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_message_table", scope: !44, file: !6, line: 713, baseType: !65, size: 32, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "last_jpeg_message", scope: !44, file: !6, line: 714, baseType: !51, size: 32, offset: 288)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "addon_message_table", scope: !44, file: !6, line: 718, baseType: !65, size: 32, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "first_addon_message", scope: !44, file: !6, line: 719, baseType: !51, size: 32, offset: 352)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "last_addon_message", scope: !44, file: !6, line: 720, baseType: !51, size: 32, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !40, file: !6, line: 242, baseType: !74, size: 32, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cjpeg_wrbmp_jpeg_memory_mgr", file: !6, line: 789, size: 416, elements: !76)
!76 = !{!77, !83, !84, !96, !110, !118, !125, !126, !130, !134, !135, !136, !137}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_small", scope: !75, file: !6, line: 791, baseType: !78, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !38, !51, !82}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "cjpeg_wrbmp_size_t", file: !6, line: 29, baseType: !7)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_large", scope: !75, file: !6, line: 794, baseType: !78, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_sarray", scope: !75, file: !6, line: 797, baseType: !85, size: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 32)
!86 = !DISubroutineType(types: !87)
!87 = !{!88, !38, !51, !95, !95}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "CJPEG_WRBMP_JSAMPARRAY", file: !6, line: 51, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "CJPEG_WRBMP_JSAMPROW", file: !6, line: 49, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "CJPEG_WRBMP_JSAMPLE", file: !93, line: 30, baseType: !94)
!93 = !DIFile(filename: "cjpeg_wrbmp/jmorecfg.h", directory: "/workspaces/llvmta/testcases/batchtest")
!94 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "CJPEG_WRBMP_JDIMENSION", file: !93, line: 63, baseType: !7)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_barray", scope: !75, file: !6, line: 801, baseType: !97, size: 32, offset: 96)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !38, !51, !95, !95}
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "CJPEG_WRBMP_JBLOCKARRAY", file: !6, line: 60, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "CJPEG_WRBMP_JBLOCKROW", file: !6, line: 58, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "CJPEG_WRBMP_JBLOCK", file: !6, line: 56, baseType: !105)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 1024, elements: !108)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "CJPEG_WRBMP_JCOEF", file: !93, line: 31, baseType: !107)
!107 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!108 = !{!109}
!109 = !DISubrange(count: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_sarray", scope: !75, file: !6, line: 805, baseType: !111, size: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!112 = !DISubroutineType(types: !113)
!113 = !{!114, !38, !51, !117, !95, !95, !95}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "cjpeg_wrbmp_jvirt_sarray_ptr", file: !6, line: 785, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_sarray_control", file: !6, line: 785, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "cjpeg_wrbmp_boolean", file: !93, line: 93, baseType: !51)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "request_virt_barray", scope: !75, file: !6, line: 812, baseType: !119, size: 32, offset: 160)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = !DISubroutineType(types: !121)
!121 = !{!122, !38, !51, !117, !95, !95, !95}
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "cjpeg_wrbmp_jvirt_barray_ptr", file: !6, line: 786, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "jvirt_barray_control", file: !6, line: 786, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "realize_virt_arrays", scope: !75, file: !6, line: 819, baseType: !35, size: 32, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_sarray", scope: !75, file: !6, line: 821, baseType: !127, size: 32, offset: 224)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = !DISubroutineType(types: !129)
!129 = !{!88, !38, !114, !95, !95, !117}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "access_virt_barray", scope: !75, file: !6, line: 827, baseType: !131, size: 32, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!132 = !DISubroutineType(types: !133)
!133 = !{!100, !38, !122, !95, !95, !117}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "free_pool", scope: !75, file: !6, line: 833, baseType: !48, size: 32, offset: 288)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "self_destruct", scope: !75, file: !6, line: 835, baseType: !35, size: 32, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "max_memory_to_use", scope: !75, file: !6, line: 843, baseType: !63, size: 32, offset: 352)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "max_alloc_chunk", scope: !75, file: !6, line: 846, baseType: !63, size: 32, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !40, file: !6, line: 242, baseType: !139, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !40, file: !6, line: 242, baseType: !81, size: 32, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !40, file: !6, line: 242, baseType: !117, size: 32, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !40, file: !6, line: 242, baseType: !51, size: 32, offset: 160)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "pass_counter", scope: !32, file: !6, line: 730, baseType: !63, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "pass_limit", scope: !32, file: !6, line: 731, baseType: !63, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "completed_passes", scope: !32, file: !6, line: 732, baseType: !51, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "total_passes", scope: !32, file: !6, line: 733, baseType: !51, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "completed_extra_passes", scope: !29, file: !27, line: 95, baseType: !51, size: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "total_extra_passes", scope: !29, file: !27, line: 96, baseType: !51, size: 32, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "percent_done", scope: !29, file: !27, line: 98, baseType: !51, size: 32, offset: 224)
!150 = !{!151, !157, !160, !0, !162, !378, !398}
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "cjpeg_wrbmp_output_array", scope: !2, file: !153, line: 49, type: !154, isLocal: false, isDefinition: true)
!153 = !DIFile(filename: "cjpeg_wrbmp/cjpeg_wrbmp.c", directory: "/workspaces/llvmta/testcases/batchtest")
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 49152, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 6144)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "cjpeg_wrbmp_jpeg_stream", scope: !2, file: !153, line: 50, type: !159, isLocal: false, isDefinition: true)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "cjpeg_wrbmp_checksum", scope: !2, file: !153, line: 51, type: !51, isLocal: false, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "cjpeg_wrbmp_jpeg_dec_2", scope: !2, file: !153, line: 56, type: !164, isLocal: false, isDefinition: true)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cjpeg_wrbmp_jpeg_decompress_struct", file: !6, line: 406, size: 3680, elements: !165)
!165 = !{!166, !167, !168, !169, !170, !171, !172, !200, !201, !202, !203, !205, !206, !207, !208, !210, !211, !212, !214, !215, !216, !217, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !239, !252, !268, !269, !270, !296, !297, !298, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !325, !326, !327, !328, !329, !330, !331, !333, !334, !335, !336, !340, !341, !342, !343, !344, !345, !348, !351, !354, !357, !360, !363, !366, !369, !372, !375}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !164, file: !6, line: 407, baseType: !43, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !164, file: !6, line: 407, baseType: !74, size: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !164, file: !6, line: 407, baseType: !139, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !164, file: !6, line: 407, baseType: !81, size: 32, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "is_decompressor", scope: !164, file: !6, line: 407, baseType: !117, size: 32, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "global_state", scope: !164, file: !6, line: 407, baseType: !51, size: 32, offset: 160)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !164, file: !6, line: 410, baseType: !173, size: 32, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cjpeg_wrbmp_jpeg_source_mgr", file: !6, line: 756, size: 224, elements: !175)
!175 = !{!176, !180, !181, !187, !191, !195, !199}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next_input_byte", scope: !174, file: !6, line: 758, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "CJPEG_WRBMP_JOCTET", file: !93, line: 32, baseType: !94)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_in_buffer", scope: !174, file: !6, line: 759, baseType: !82, size: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "init_source", scope: !174, file: !6, line: 761, baseType: !182, size: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !185}
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "cjpeg_wrbmp_j_decompress_ptr", file: !6, line: 254, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "fill_input_buffer", scope: !174, file: !6, line: 763, baseType: !188, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DISubroutineType(types: !190)
!190 = !{!117, !185}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "skip_input_data", scope: !174, file: !6, line: 765, baseType: !192, size: 32, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !185, !63}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "resync_to_restart", scope: !174, file: !6, line: 767, baseType: !196, size: 32, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DISubroutineType(types: !198)
!198 = !{!117, !185, !51}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "term_source", scope: !174, file: !6, line: 769, baseType: !182, size: 32, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !164, file: !6, line: 416, baseType: !95, size: 32, offset: 224)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !164, file: !6, line: 417, baseType: !95, size: 32, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "num_components", scope: !164, file: !6, line: 418, baseType: !51, size: 32, offset: 288)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "jpeg_color_space", scope: !164, file: !6, line: 420, baseType: !204, size: 32, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "CJPEG_WRBMP_J_COLOR_SPACE", file: !6, line: 208, baseType: !5)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_space", scope: !164, file: !6, line: 427, baseType: !204, size: 32, offset: 352)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "scale_num", scope: !164, file: !6, line: 429, baseType: !7, size: 32, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "scale_denom", scope: !164, file: !6, line: 429, baseType: !7, size: 32, offset: 416)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "output_gamma", scope: !164, file: !6, line: 431, baseType: !209, size: 32, offset: 448)
!209 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "buffered_image", scope: !164, file: !6, line: 433, baseType: !117, size: 32, offset: 480)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data_out", scope: !164, file: !6, line: 434, baseType: !117, size: 32, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "dct_method", scope: !164, file: !6, line: 436, baseType: !213, size: 32, offset: 544)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "CJPEG_WRBMP_J_DCT_METHOD", file: !6, line: 216, baseType: !15)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "do_fancy_upsampling", scope: !164, file: !6, line: 438, baseType: !117, size: 32, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "do_block_smoothing", scope: !164, file: !6, line: 440, baseType: !117, size: 32, offset: 608)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_colors", scope: !164, file: !6, line: 443, baseType: !117, size: 32, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "dither_mode", scope: !164, file: !6, line: 446, baseType: !218, size: 32, offset: 672)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "CJPEG_WRBMP_J_DITHER_MODE", file: !6, line: 224, baseType: !20)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "two_pass_quantize", scope: !164, file: !6, line: 448, baseType: !117, size: 32, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "desired_number_of_colors", scope: !164, file: !6, line: 449, baseType: !51, size: 32, offset: 736)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "enable_1pass_quant", scope: !164, file: !6, line: 452, baseType: !117, size: 32, offset: 768)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "enable_EXTERNal_quant", scope: !164, file: !6, line: 454, baseType: !117, size: 32, offset: 800)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "enable_2pass_quant", scope: !164, file: !6, line: 456, baseType: !117, size: 32, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "output_width", scope: !164, file: !6, line: 464, baseType: !95, size: 32, offset: 864)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "output_height", scope: !164, file: !6, line: 465, baseType: !95, size: 32, offset: 896)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "out_color_components", scope: !164, file: !6, line: 466, baseType: !51, size: 32, offset: 928)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "output_components", scope: !164, file: !6, line: 467, baseType: !51, size: 32, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "rec_outbuf_height", scope: !164, file: !6, line: 471, baseType: !51, size: 32, offset: 992)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "actual_number_of_colors", scope: !164, file: !6, line: 483, baseType: !51, size: 32, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !164, file: !6, line: 485, baseType: !88, size: 32, offset: 1056)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "output_scanline", scope: !164, file: !6, line: 495, baseType: !95, size: 32, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "input_scan_number", scope: !164, file: !6, line: 500, baseType: !51, size: 32, offset: 1120)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "input_iMCU_row", scope: !164, file: !6, line: 502, baseType: !95, size: 32, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "output_scan_number", scope: !164, file: !6, line: 508, baseType: !51, size: 32, offset: 1184)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "output_iMCU_row", scope: !164, file: !6, line: 509, baseType: !95, size: 32, offset: 1216)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "coef_bits", scope: !164, file: !6, line: 518, baseType: !237, size: 32, offset: 1248)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 2048, elements: !108)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_ptrs", scope: !164, file: !6, line: 529, baseType: !240, size: 128, offset: 1280)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 128, elements: !250)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "CJPEG_WRBMP_JQUANT_TBL", file: !6, line: 86, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 73, size: 1056, elements: !244)
!244 = !{!245, !249}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "quantval", scope: !243, file: !6, line: 79, baseType: !246, size: 1024)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 1024, elements: !108)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "CJPEG_WRBMP_UINT16", file: !93, line: 48, baseType: !248)
!248 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !243, file: !6, line: 85, baseType: !117, size: 32, offset: 1024)
!250 = !{!251}
!251 = !DISubrange(count: 4)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "dc_huff_tbl_ptrs", scope: !164, file: !6, line: 532, baseType: !253, size: 128, offset: 1408)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 128, elements: !250)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "CJPEG_WRBMP_JHUFF_TBL", file: !6, line: 103, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 91, size: 2240, elements: !257)
!257 = !{!258, !263, !267}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !256, file: !6, line: 93, baseType: !259, size: 136)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 136, elements: !261)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "CJPEG_WRBMP_UINT8", file: !93, line: 43, baseType: !94)
!261 = !{!262}
!262 = !DISubrange(count: 17)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "huffval", scope: !256, file: !6, line: 96, baseType: !264, size: 2048, offset: 136)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 2048, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "sent_table", scope: !256, file: !6, line: 102, baseType: !117, size: 32, offset: 2208)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ac_huff_tbl_ptrs", scope: !164, file: !6, line: 533, baseType: !253, size: 128, offset: 1536)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "data_precision", scope: !164, file: !6, line: 540, baseType: !51, size: 32, offset: 1664)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "comp_info", scope: !164, file: !6, line: 542, baseType: !271, size: 32, offset: 1696)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "cjpeg_wrbmp_jpeg_component_info", file: !6, line: 172, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 108, size: 672, elements: !274)
!274 = !{!275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "component_id", scope: !273, file: !6, line: 112, baseType: !51, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "component_index", scope: !273, file: !6, line: 113, baseType: !51, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "h_samp_factor", scope: !273, file: !6, line: 114, baseType: !51, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "v_samp_factor", scope: !273, file: !6, line: 115, baseType: !51, size: 32, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "quant_tbl_no", scope: !273, file: !6, line: 116, baseType: !51, size: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "dc_tbl_no", scope: !273, file: !6, line: 121, baseType: !51, size: 32, offset: 160)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ac_tbl_no", scope: !273, file: !6, line: 122, baseType: !51, size: 32, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "width_in_blocks", scope: !273, file: !6, line: 131, baseType: !95, size: 32, offset: 224)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "height_in_blocks", scope: !273, file: !6, line: 132, baseType: !95, size: 32, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "DCT_scaled_size", scope: !273, file: !6, line: 139, baseType: !51, size: 32, offset: 288)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_width", scope: !273, file: !6, line: 146, baseType: !95, size: 32, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "downsampled_height", scope: !273, file: !6, line: 147, baseType: !95, size: 32, offset: 352)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "component_needed", scope: !273, file: !6, line: 153, baseType: !117, size: 32, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_width", scope: !273, file: !6, line: 157, baseType: !51, size: 32, offset: 416)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_height", scope: !273, file: !6, line: 158, baseType: !51, size: 32, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_blocks", scope: !273, file: !6, line: 159, baseType: !51, size: 32, offset: 480)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_sample_width", scope: !273, file: !6, line: 160, baseType: !51, size: 32, offset: 512)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "last_col_width", scope: !273, file: !6, line: 161, baseType: !51, size: 32, offset: 544)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "last_row_height", scope: !273, file: !6, line: 162, baseType: !51, size: 32, offset: 576)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "quant_table", scope: !273, file: !6, line: 168, baseType: !241, size: 32, offset: 608)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "dct_table", scope: !273, file: !6, line: 171, baseType: !81, size: 32, offset: 640)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_mode", scope: !164, file: !6, line: 546, baseType: !117, size: 32, offset: 1728)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "arith_code", scope: !164, file: !6, line: 548, baseType: !117, size: 32, offset: 1760)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_L", scope: !164, file: !6, line: 551, baseType: !299, size: 128, offset: 1792)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 128, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 16)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "arith_dc_U", scope: !164, file: !6, line: 553, baseType: !299, size: 128, offset: 1920)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "arith_ac_K", scope: !164, file: !6, line: 555, baseType: !299, size: 128, offset: 2048)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "restart_interval", scope: !164, file: !6, line: 558, baseType: !7, size: 32, offset: 2176)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "saw_JFIF_marker", scope: !164, file: !6, line: 564, baseType: !117, size: 32, offset: 2208)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "JFIF_major_version", scope: !164, file: !6, line: 566, baseType: !260, size: 8, offset: 2240)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "JFIF_minor_version", scope: !164, file: !6, line: 567, baseType: !260, size: 8, offset: 2248)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "density_unit", scope: !164, file: !6, line: 568, baseType: !260, size: 8, offset: 2256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "X_density", scope: !164, file: !6, line: 569, baseType: !247, size: 16, offset: 2272)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "Y_density", scope: !164, file: !6, line: 570, baseType: !247, size: 16, offset: 2288)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "saw_Adobe_marker", scope: !164, file: !6, line: 572, baseType: !117, size: 32, offset: 2304)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "Adobe_transform", scope: !164, file: !6, line: 574, baseType: !260, size: 8, offset: 2336)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "CCIR601_sampling", scope: !164, file: !6, line: 577, baseType: !117, size: 32, offset: 2368)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "marker_list", scope: !164, file: !6, line: 583, baseType: !315, size: 32, offset: 2400)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "jpeg_saved_marker_ptr", file: !6, line: 187, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cjpeg_wrbmp_jpeg_marker_struct", file: !6, line: 189, size: 160, elements: !318)
!318 = !{!319, !320, !321, !322, !323}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !6, line: 190, baseType: !315, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !317, file: !6, line: 191, baseType: !260, size: 8, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "original_length", scope: !317, file: !6, line: 192, baseType: !7, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "data_length", scope: !317, file: !6, line: 193, baseType: !7, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !317, file: !6, line: 195, baseType: !324, size: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "max_h_samp_factor", scope: !164, file: !6, line: 592, baseType: !51, size: 32, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "max_v_samp_factor", scope: !164, file: !6, line: 593, baseType: !51, size: 32, offset: 2464)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "min_DCT_scaled_size", scope: !164, file: !6, line: 595, baseType: !51, size: 32, offset: 2496)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "total_iMCU_rows", scope: !164, file: !6, line: 597, baseType: !95, size: 32, offset: 2528)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "sample_range_limit", scope: !164, file: !6, line: 607, baseType: !91, size: 32, offset: 2560)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "comps_in_scan", scope: !164, file: !6, line: 614, baseType: !51, size: 32, offset: 2592)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "cur_comp_info", scope: !164, file: !6, line: 615, baseType: !332, size: 128, offset: 2624)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 128, elements: !250)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "MCUs_per_row", scope: !164, file: !6, line: 618, baseType: !95, size: 32, offset: 2752)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_rows_in_scan", scope: !164, file: !6, line: 620, baseType: !95, size: 32, offset: 2784)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_in_MCU", scope: !164, file: !6, line: 622, baseType: !51, size: 32, offset: 2816)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "MCU_membership", scope: !164, file: !6, line: 623, baseType: !337, size: 320, offset: 2848)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 320, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 10)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Ss", scope: !164, file: !6, line: 627, baseType: !51, size: 32, offset: 3168)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Se", scope: !164, file: !6, line: 627, baseType: !51, size: 32, offset: 3200)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "Ah", scope: !164, file: !6, line: 627, baseType: !51, size: 32, offset: 3232)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Al", scope: !164, file: !6, line: 627, baseType: !51, size: 32, offset: 3264)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "unread_marker", scope: !164, file: !6, line: 633, baseType: !51, size: 32, offset: 3296)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !164, file: !6, line: 638, baseType: !346, size: 32, offset: 3328)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_decomp_master", file: !6, line: 638, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !164, file: !6, line: 639, baseType: !349, size: 32, offset: 3360)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 32)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_main_controller", file: !6, line: 639, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !164, file: !6, line: 640, baseType: !352, size: 32, offset: 3392)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_coef_controller", file: !6, line: 640, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "post", scope: !164, file: !6, line: 641, baseType: !355, size: 32, offset: 3424)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_d_post_controller", file: !6, line: 641, flags: DIFlagFwdDecl)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "inputctl", scope: !164, file: !6, line: 642, baseType: !358, size: 32, offset: 3456)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_input_controller", file: !6, line: 642, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !164, file: !6, line: 643, baseType: !361, size: 32, offset: 3488)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_marker_reader", file: !6, line: 643, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !164, file: !6, line: 644, baseType: !364, size: 32, offset: 3520)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_entropy_decoder", file: !6, line: 644, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !164, file: !6, line: 645, baseType: !367, size: 32, offset: 3552)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_inverse_dct", file: !6, line: 645, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "upsample", scope: !164, file: !6, line: 646, baseType: !370, size: 32, offset: 3584)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_upsampler", file: !6, line: 646, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "cconvert", scope: !164, file: !6, line: 647, baseType: !373, size: 32, offset: 3616)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_deconverter", file: !6, line: 647, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "cquantize", scope: !164, file: !6, line: 648, baseType: !376, size: 32, offset: 3648)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "jpeg_color_quantizer", file: !6, line: 648, flags: DIFlagFwdDecl)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "cjpeg_wrbmp_djpeg_dest", scope: !2, file: !153, line: 58, type: !380, isLocal: false, isDefinition: true)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cjpeg_wrbmp_djpeg_dest_struct", file: !27, line: 57, size: 192, elements: !381)
!381 = !{!382, !388, !392, !393, !396, !397}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "start_output", scope: !380, file: !27, line: 58, baseType: !383, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !185, !386}
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "cjpeg_wrbmp_djpeg_dest_ptr", file: !27, line: 55, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "put_pixel_rows", scope: !380, file: !27, line: 62, baseType: !389, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !185, !386, !95}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "finish_output", scope: !380, file: !27, line: 67, baseType: !383, size: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "output_file", scope: !380, file: !27, line: 72, baseType: !394, size: 32, offset: 96)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "CJPEG_WRBMP_FILE", file: !6, line: 28, baseType: !51)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !380, file: !27, line: 78, baseType: !88, size: 32, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_height", scope: !380, file: !27, line: 79, baseType: !95, size: 32, offset: 160)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "cjpeg_wrbmp_bmp_dest", scope: !2, file: !153, line: 59, type: !400, isLocal: false, isDefinition: true)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "cjpeg_wrbmp_bmp_dest_struct", file: !153, line: 45, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !153, line: 34, size: 384, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408, !409}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pub", scope: !401, file: !153, line: 35, baseType: !380, size: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "is_os2", scope: !401, file: !153, line: 36, baseType: !117, size: 32, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "whole_image", scope: !401, file: !153, line: 38, baseType: !114, size: 32, offset: 224)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "data_width", scope: !401, file: !153, line: 39, baseType: !95, size: 32, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "row_width", scope: !401, file: !153, line: 41, baseType: !95, size: 32, offset: 288)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pad_bytes", scope: !401, file: !153, line: 42, baseType: !51, size: 32, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "cur_output_row", scope: !401, file: !153, line: 44, baseType: !95, size: 32, offset: 352)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "cjpeg_wrbmp_colormap", scope: !412, file: !415, line: 20, type: !416, isLocal: false, isDefinition: true)
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "clang version 14.0.6 (git@github.com:RTS-SYSU/LLVM-TA.git 433861ba697f56477d8849df0fa6165a1e09982d)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !414, splitDebugInlining: false, nameTableKind: None)
!413 = !DIFile(filename: "/workspaces/llvmta/testcases/batchtest/cjpeg_wrbmp/input.c", directory: "/workspaces/llvmta/testcases/batchtest/bsort")
!414 = !{!410}
!415 = !DIFile(filename: "cjpeg_wrbmp/input.c", directory: "/workspaces/llvmta/testcases/batchtest")
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 6144, elements: !417)
!417 = !{!418, !266}
!418 = !DISubrange(count: 3)
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !420, producer: "clang version 14.0.6 (git@gitlab.tu-dortmund.de:f4-ls12-daes/llvmta/llvmta.git 64262528b05c9d91a76d9ec1ec1045982f385529)", isOptimized: false, runtimeVersion: 0, emissionKind: LineTablesOnly, splitDebugInlining: false, nameTableKind: None)
!420 = !DIFile(filename: "../absvdi2.c", directory: "/workspaces/llvmta/testcases/libraries/builtinsint/buildarmv4", checksumkind: CSK_MD5, checksum: "f0fa545ed84eab29322431dd903e1bd2")
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "clang version 14.0.6 (git@gitlab.tu-dortmund.de:f4-ls12-daes/llvmta/llvmta.git 64262528b05c9d91a76d9ec1ec1045982f385529)", isOptimized: false, runtimeVersion: 0, emissionKind: LineTablesOnly, splitDebugInlining: false, nameTableKind: None)
!422 = !DIFile(filename: "../absvsi2.c", directory: "/workspaces/llvmta/testcases/libraries/builtinsint/buildarmv4", checksumkind: CSK_MD5, checksum: "4c623fefc2c7ed3929c6e73514b667d1")
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "clang version 14.0.6 (git@gitlab.tu-dortmund.de:f4-ls12-daes/llvmta/llvmta.git 64262528b05c9d91a76d9ec1ec1045982f385529)", isOptimized: false, runtimeVersion: 0, emissionKind: LineTablesOnly, splitDebugInlining: false, nameTableKind: None)
!424 = !DIFile(filename: "../absvti2.c", directory: "/workspaces/llvmta/testcases/libraries/builtinsint/buildarmv4", checksumkind: CSK_MD5, checksum: "37a4bc629baa89b5b7c1570be0d03e1f")
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "clang version 14.0.6 (git@gitlab.tu-dortmund.de:f4-ls12-daes/llvmta/llvmta.git 64262528b05c9d91a76d9ec1ec1045982f385529)", isOptimized: false, runtimeVersion: 0, emissionKind: LineTablesOnly, splitDebugInlining: false, nameTableKind: None)
!426 = !DIFile(filename: "../addvdi3.c", directory: "/workspaces/llvmta/testcases/libraries/builtinsint/buildarmv4", checksumkind: CSK_MD5, checksum: "aa240ee8ce7c28b2c3bcec10a7603d3f")
!427 = distinct !DICompileUnit(language: DW_LANG_C99, file: !428, producer: "clang version 14.0.6 (git@gitlab.tu-dortmund.de:f4-ls12-daes/llvmta/llvmta.git 64262528b05c9d91a76d9ec1ec1045982f385529)", isOptimized: false, runtimeVersion: 0, emissionKind: LineTablesOnly, splitDebugInlining: false, nameTableKind: None)
!428 = !DIFile(filename: "../addvsi3.c", directory: "/workspaces/llvmta/testcases/libraries/builtinsint/buildarmv4", checksumkind: CSK_MD5, checksum: "6cd4d40cc00928f1aaf6f29e299078cd")
!429 = distinct !DICompileUnit(language: DW_LANG_C99, file: !430, producer: "clang version 14.0.6 (git@gitlab.tu-dortmund.de:f4-ls12-daes/llvmta/llvmta.git 64262528b05c9d91a76d9ec1ec1045982f385529)", isOptimized: false, runtimeVersion: 0, emissionKind: LineTablesOnly, splitDebugInlining: false, nameTableKind: None)
