; ModuleID = 'unoptimized.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "armv4t-unknown-unknown"

%struct.h264_dec_img_par = type { i32, i32, i32, i32, i32, [16 x [16 x i16]], i32, i32, i32, i32, i32, i32 }
%union.dwords = type { i64 }
%struct.anon = type { i32, i32 }

@h264_dec_img_mpr = dso_local global [7 x [7 x i8]] zeroinitializer, align 1, !dbg !0
@h264_dec_dec_picture_imgUV = dso_local global [2 x [64 x [54 x i8]]] zeroinitializer, align 1, !dbg !18
@h264_dec_mv_array = dso_local global [65 x [65 x [2 x i8]]] zeroinitializer, align 1, !dbg !51

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "h264_dec_img_mpr", scope: !2, file: !20, line: 50, type: !48, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 14.0.6 (git@github.com:RTS-SYSU/LLVM-TA.git 433861ba697f56477d8849df0fa6165a1e09982d)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !14, globals: !17, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/workspaces/llvmta/testcases/batchtest/h264_dec/h264_dec.c", directory: "/workspaces/llvmta/testcases/batchtest/g723_enc")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 4, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "h264_dec/h264_dec.h", directory: "/workspaces/llvmta/testcases/batchtest")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "P_SLICE", value: 0)
!10 = !DIEnumerator(name: "B_SLICE", value: 1)
!11 = !DIEnumerator(name: "I_SLICE", value: 2)
!12 = !DIEnumerator(name: "SP_SLICE", value: 3)
!13 = !DIEnumerator(name: "SI_SLICE", value: 4)
!14 = !{!15}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 32)
!16 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !{!0, !18, !27}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "h264_dec_dec_picture_imgUV", scope: !2, file: !20, line: 51, type: !21, isLocal: false, isDefinition: true)
!20 = !DIFile(filename: "h264_dec/h264_dec.c", directory: "/workspaces/llvmta/testcases/batchtest")
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 55296, elements: !23)
!22 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!23 = !{!24, !25, !26}
!24 = !DISubrange(count: 2)
!25 = !DISubrange(count: 64)
!26 = !DISubrange(count: 54)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "h264_dec_img", scope: !2, file: !20, line: 52, type: !29, isLocal: false, isDefinition: true)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "h264_dec_img_par", file: !6, line: 13, size: 4448, elements: !30)
!30 = !{!31, !33, !34, !35, !36, !37, !42, !43, !44, !45, !46, !47}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !29, file: !6, line: 14, baseType: !32, size: 32)
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !29, file: !6, line: 15, baseType: !32, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !29, file: !6, line: 16, baseType: !32, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !29, file: !6, line: 17, baseType: !32, size: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !29, file: !6, line: 18, baseType: !32, size: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "mpr", scope: !29, file: !6, line: 19, baseType: !38, size: 4096, offset: 160)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 4096, elements: !40)
!39 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!40 = !{!41, !41}
!41 = !DISubrange(count: 16)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_log2_weight_denom", scope: !29, file: !6, line: 20, baseType: !7, size: 32, offset: 4256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "wp_round_chroma", scope: !29, file: !6, line: 21, baseType: !32, size: 32, offset: 4288)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "apply_weights", scope: !29, file: !6, line: 22, baseType: !7, size: 32, offset: 4320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !29, file: !6, line: 23, baseType: !32, size: 32, offset: 4352)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !29, file: !6, line: 24, baseType: !32, size: 32, offset: 4384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !29, file: !6, line: 25, baseType: !32, size: 32, offset: 4416)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 392, elements: !49)
!49 = !{!50, !50}
!50 = !DISubrange(count: 7)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "h264_dec_mv_array", scope: !53, file: !58, line: 1, type: !66, isLocal: false, isDefinition: true)
!53 = distinct !DICompileUnit(language: DW_LANG_C99, file: !54, producer: "clang version 14.0.6 (git@github.com:RTS-SYSU/LLVM-TA.git 433861ba697f56477d8849df0fa6165a1e09982d)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !55, splitDebugInlining: false, nameTableKind: None)
!54 = !DIFile(filename: "/workspaces/llvmta/testcases/batchtest/h264_dec/h264_decinput.c", directory: "/workspaces/llvmta/testcases/batchtest/g723_enc")
!55 = !{!51, !56, !63}
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "h264_dec_list_imgUV", scope: !53, file: !58, line: 329, type: !59, isLocal: false, isDefinition: true)
!58 = !DIFile(filename: "h264_dec/h264_decinput.c", directory: "/workspaces/llvmta/testcases/batchtest")
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 64800, elements: !61)
!60 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!61 = !{!24, !62, !62}
!62 = !DISubrange(count: 45)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "h264_dec_img_m7", scope: !53, file: !58, line: 784, type: !65, isLocal: false, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8192, elements: !40)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 67600, elements: !67)
!67 = !{!68, !68, !24}
!68 = !DISubrange(count: 65)
!69 = distinct !DICompileUnit(language: DW_LANG_C99, file: !70, producer: "clang version 14.0.6 (git@gitlab.tu-dortmund.de:f4-ls12-daes/llvmta/llvmta.git 64262528b05c9d91a76d9ec1ec1045982f385529)", isOptimized: false, runtimeVersion: 0, emissionKind: LineTablesOnly, splitDebugInlining: false, nameTableKind: None)
!70 = !DIFile(filename: "../absvdi2.c", directory: "/workspaces/llvmta/testcases/libraries/builtinsint/buildarmv4", checksumkind: CSK_MD5, checksum: "f0fa545ed84eab29322431dd903e1bd2")
!71 = distinct !DICompileUnit(language: DW_LANG_C99, file: !72, producer: "clang version 14.0.6 (git@gitlab.tu-dortmund.de:f4-ls12-daes/llvmta/llvmta.git 64262528b05c9d91a76d9ec1ec1045982f385529)", isOptimized: false, runtimeVersion: 0, emissionKind: LineTablesOnly, splitDebugInlining: false, nameTableKind: None)
!72 = !DIFile(filename: "../absvsi2.c", directory: "/workspaces/llvmta/testcases/libraries/builtinsint/buildarmv4", checksumkind: CSK_MD5, checksum: "4c623fefc2c7ed3929c6e73514b667d1")
!73 = distinct !DICompileUnit(language: DW_LANG_C99, file: !74, producer: "clang version 14.0.6 (git@gitlab.tu-dortmund.de:f4-ls12-daes/llvmta/llvmta.git 64262528b05c9d91a76d9ec1ec1045982f385529)", isOptimized: false, runtimeVersion: 0, emissionKind: LineTablesOnly, splitDebugInlining: false, nameTableKind: None)
!74 = !DIFile(filename: "../absvti2.c", directory: "/workspaces/llvmta/testcases/libraries/builtinsint/buildarmv4", checksumkind: CSK_MD5, checksum: "37a4bc629baa89b5b7c1570be0d03e1f")
!75 = distinct !DICompileUnit(language: DW_LANG_C99, file: !76, producer: "clang version 14.0.6 (git@gitlab.tu-dortmund.de:f4-ls12-daes/llvmta/llvmta.git 64262528b05c9d91a76d9ec1ec1045982f385529)", isOptimized: false, runtimeVersion: 0, emissionKind: LineTablesOnly, splitDebugInlining: false, nameTableKind: None)
!76 = !DIFile(filename: "../addvdi3.c", directory: "/workspaces/llvmta/testcases/libraries/builtinsint/buildarmv4", checksumkind: CSK_MD5, checksum: "aa240ee8ce7c28b2c3bcec10a7603d3f")
